<a href="https://colab.research.google.com/github/boramkim0514/hw/blob/boramkim0514-patch-1/day12_ipynb%EC%9D%98_%EC%82%AC%EB%B3%B8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

moun//unmount HD driver 내 하드 디스크와의 연결/끊기

pandas ndarray

Series 1차원 배열 / Dataframe 2차원 배열

파일 > Git hubdp 에 사본 저장 

도구 > 설정 /편집

판다스 쓰는 이유:자료구조가 연속적 배열이라서 메모리의 처리 속도가 빠름 

markup / markdown

mount = 클라우딩 드라이브와 연결
unmount = 클라우딩 연결해제

In [ ]:
!ls

sample_data

In [ ]:
import platform

In [ ]:
platform.platform()

'Linux-5.4.109+-x86_64-with-Ubuntu-18.04-bionic'

In [ ]:
whoami

NameError: ignored

# 5월 20일 오전 수업
## 코랩 기초 사용법
### 열심히 공부해야지

### PWD ==> PRINT WORKING DIRECTORY (현재 위치 확인)

In [ ]:
!nl /etc/issue.net

In [ ]:
!nl /proc/cpuinfo

In [ ]:
!nl /proc/meminfo

In [ ]:
!df -h #disk free 라는 의미 알아두면 좋은 개념 /dev/sea1

CPU 속도 바꾸기 수정 노트설정 런타임 > 모두 실행

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

# 새 섹션

In [ ]:
!pwd

/content

In [ ]:
from google.colab import drive #마운트 시작

In [ ]:
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
!df -h #15G 연결되었고, /content/drive에 썼음 contet > Drive> MyDrive

Filesystem      Size  Used Avail Use% Mounted on
overlay         108G   39G   70G  36% /
tmpfs            64M     0   64M   0% /dev
tmpfs           6.4G     0  6.4G   0% /sys/fs/cgroup
shm             5.9G     0  5.9G   0% /dev/shm
tmpfs           6.4G   24K  6.4G   1% /var/colab
/dev/sda1       114G   41G   74G  36% /etc/hosts
tmpfs           6.4G     0  6.4G   0% /proc/acpi
tmpfs           6.4G     0  6.4G   0% /proc/scsi
tmpfs           6.4G     0  6.4G   0% /sys/firmware
drive            15G  5.3G  9.8G  35% /content/drive

In [ ]:
!pwd

/content

In [ ]:
!LS

/bin/bash: LS: command not found

In [ ]:
!ls

drive  sample_data

In [ ]:
!cat ess.xlsx

cat: ess.xlsx: No such file or directory

In [ ]:
import pandas as pd

In [ ]:
pd1=pd.read_excel('/content/sample_data/ess.xlsx') #다시 해보기

**볼드**
__bold__
**목요일**
*기울기*
~~취소선~~
<u> 밑줄 </u>

[구글](http://www.google.com)
[코딩스쿨](http://func.kr)
[유튜브](http://youtube.com)

![바다](https://www.google.com/url?sa=i&url=http%3A%2F%2Fblog.idbins.com%2F1844&psig=AOvVaw0ayoHMg1gkaw_zWev4eKE7&ust=1621560197527000&source=images&cd=vfe&ved=0CAIQjRxqFwoTCLDi2M6M1_ACFQAAAAAdAAAAABAD

In [ ]:
%hist

!ls
import platform
import platform
platform.platform
platform.platform()
### PWD ==> PRINT WORKING DIRECTORY (현재 위치 확인)
!nl/etc/issue.net
!nl /etc/issue.net
!nl /proc/cpuinfo
!nl /pr oc/meaninfo
!nl /proo/meaninfo
!nl /proc/meaninfo
!nl /proc/meminfo
!df -h #disk free 라는 의미 알아두면 좋은 개념 /dev/sea1
!ls
!ls
import platform
platform.platform()
whoami
!ls
!pwd
from google.colab import drive #마운트 시작
drive.mount()
drive.mount('/content/drive')
!df -h
!pwd
!LS
!ls
!cat ess.xlsx
import pandas as pd
pd1=pd.read_excel()
pd1=pd.read_excel(/content/sample_data/ess.xlsx)
!cat ess.xlsx
pd1=pd.read_excel(/content/sample_data/ess.xlsx)
!cat ess.xlsx
import pandas as pd
pd1=pd.read_excel(/content/sample_data/ess.xlsx)
pd1=pd.read_excel('/content/sample_data/ess.xlsx')
pd1=pd.read_excel('/content/sample_data/ess.xlsx')
adfadfadfadfadfadf
%hist

In [ ]:
%hist

!ls
import platform
import platform
platform.platform
platform.platform()
### PWD ==> PRINT WORKING DIRECTORY (현재 위치 확인)
!nl/etc/issue.net
!nl /etc/issue.net
!nl /proc/cpuinfo
!nl /pr oc/meaninfo
!nl /proo/meaninfo
!nl /proc/meaninfo
!nl /proc/meminfo
!df -h #disk free 라는 의미 알아두면 좋은 개념 /dev/sea1
!ls
!ls
import platform
platform.platform()
whoami
!ls
!pwd
from google.colab import drive #마운트 시작
drive.mount()
drive.mount('/content/drive')
!df -h
!pwd
!LS
!ls
!cat ess.xlsx
import pandas as pd
pd1=pd.read_excel()
pd1=pd.read_excel(/content/sample_data/ess.xlsx)
!cat ess.xlsx
pd1=pd.read_excel(/content/sample_data/ess.xlsx)
!cat ess.xlsx
import pandas as pd
pd1=pd.read_excel(/content/sample_data/ess.xlsx)
pd1=pd.read_excel('/content/sample_data/ess.xlsx')
pd1=pd.read_excel('/content/sample_data/ess.xlsx')
adfadfadfadfadfadf
%hist
%hist

In [ ]:
!ls

drive  sample_data  ss.txt

In [ ]:
!cat -n ss.txt #n numbering

     1	이순신 85 87 90
     2	강감찬 75 80 95
     3	한석봉 99 98 99
     4	황진이 35 45 20
     5	안중근 90 85 90
     6	박문수 95 98 96
     7	임꺽정 15 35 45
     8	김정호 90 95 80
     9	정몽주 90 90 95
    10	김보람 95 99 98

In [ ]:
!cat ss.txt

이순신 85 87 90
강감찬 75 80 95
한석봉 99 98 99
황진이 35 45 20
안중근 90 85 90
박문수 95 98 96
임꺽정 15 35 45
김정호 90 95 80
정몽주 90 90 95
김보람 95 99 98

In [ ]:
pd1 = pd.read_csv('/content/ss.txt') #키워드 인수처럼 sep- '.' 기본자, 모두 바꾸기 기능으로 space를 .으로 바꿔서 CVS로 변환 ANSI

In [ ]:
pd1 #파일형식 저장 방법 txt 파일 #UTF8로 인코딩

   이순신 85 87 90
0  강감찬 75 80 95
1  한석봉 99 98 99
2  황진이 35 45 20
3  안중근 90 85 90
4  박문수 95 98 96
5  임꺽정 15 35 45
6  김정호 90 95 80
7  정몽주 90 90 95
8  김보람 95 99 98

In [ ]:
d1 = pd.read_csv('/content/ss.txt')

In [ ]:
d1

   이순신 85 87 90
0  강감찬 75 80 95
1  한석봉 99 98 99
2  황진이 35 45 20
3  안중근 90 85 90
4  박문수 95 98 96
5  임꺽정 15 35 45
6  김정호 90 95 80
7  정몽주 90 90 95
8  김보람 50 45 60

In [ ]:
d2 =pd.read_csv('/content/sc.csv')

In [ ]:
d2

   이순신  85  87  90
0  강감찬  75  80  95
1  한석봉  99  98  99
2  황진이  35  45  20
3  안중근  90  85  90
4  박문수  95  98  96
5  임꺽정  15  35  45
6  김정호  90  95  80
7  정몽주  90  90  95
8  김보람  95  99  98

In [ ]:
d3 =pd.read_excel('/content/se.xlsx', names=['이름', '국어', '영어', '수학'])

In [ ]:
d3

    이름  국어  영어  수학
0  강감찬  75  80  95
1  한석봉  99  98  99
2  황진이  35  45  20
3  안중근  90  85  90
4  박문수  95  98  96
5  임꺽정  15  35  45
6  김정호  90  95  80
7  정몽주  90  90  95
8  김보람  95  99  98

In [ ]:
d = d3.copy()

In [ ]:
d

    이름  국어  영어  수학
0  강감찬  75  80  95
1  한석봉  99  98  99
2  황진이  35  45  20
3  안중근  90  85  90
4  박문수  95  98  96
5  임꺽정  15  35  45
6  김정호  90  95  80
7  정몽주  90  90  95
8  김보람  95  99  98

In [ ]:
type(d)

pandas.core.frame.DataFrame

In [ ]:
dir(d)

In [ ]:
d.shape

(9, 4)

In [ ]:
d

    이름  국어  영어  수학
0  강감찬  75  80  95
1  한석봉  99  98  99
2  황진이  35  45  20
3  안중근  90  85  90
4  박문수  95  98  96
5  임꺽정  15  35  45
6  김정호  90  95  80
7  정몽주  90  90  95
8  김보람  95  99  98

In [ ]:
d.ndim

2

In [ ]:
d.size #item size = 4byte

36

In [ ]:
d.items

<bound method DataFrame.items of     이름  국어  영어  수학
0  강감찬  75  80  95
1  한석봉  99  98  99
2  황진이  35  45  20
3  안중근  90  85  90
4  박문수  95  98  96
5  임꺽정  15  35  45
6  김정호  90  95  80
7  정몽주  90  90  95
8  김보람  95  99  98>

In [185]:
d4 =pd.read_excel('/content/se.xlsx', columns(['이름', '국어', '영어', '수학']))

NameError: ignored

In [ ]:
d5 = pd.read_excel('/content/se.xlsx', header=None)

In [ ]:
d5.columns=['이름', '국어', '영어', '수학']

In [ ]:
d5

    이름  국어  영어  수학
0  이순신  85  87  90
1  강감찬  75  80  95
2  한석봉  99  98  99
3  황진이  35  45  20
4  안중근  90  85  90
5  박문수  95  98  96
6  임꺽정  15  35  45
7  김정호  90  95  80
8  정몽주  90  90  95
9  김보람  95  99  98

In [ ]:
d = d5.copy()

In [ ]:
d.head(3)

    이름  국어  영어  수학
0  이순신  85  87  90
1  강감찬  75  80  95
2  한석봉  99  98  99

In [ ]:
d.tail(2)

    이름  국어  영어  수학
8  정몽주  90  90  95
9  김보람  95  99  98

In [ ]:
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      10 non-null     object
 1   국어      10 non-null     int64
 2   영어      10 non-null     int64
 3   수학      10 non-null     int64
dtypes: int64(3), object(1)
memory usage: 448.0+ bytes

In [ ]:
d.describe()

              국어         영어         수학
count  10.000000  10.000000  10.000000
mean   76.900000  81.200000  80.800000
std    28.509063  22.714655  26.686659
min    15.000000  35.000000  20.000000
25%    77.500000  81.250000  82.500000
50%    90.000000  88.500000  92.500000
75%    93.750000  97.250000  95.750000
max    99.000000  99.000000  99.000000

In [ ]:
d.index

RangeIndex(start=0, stop=10, step=1)

In [ ]:
d.columns

Index(['이름', '국어', '영어', '수학'], dtype='object')

In [ ]:
d[0]

In [ ]:
d['이름']

0    이순신
1    강감찬
2    한석봉
3    황진이
4    안중근
5    박문수
6    임꺽정
7    김정호
8    정몽주
9    김보람
Name: 이름, dtype: object

In [ ]:
d[['이름','영어']] #[[ ]] 대괄호 두개씩 #column 이름으로 접근 가능

    이름  영어
0  이순신  87
1  강감찬  80
2  한석봉  98
3  황진이  45
4  안중근  85
5  박문수  98
6  임꺽정  35
7  김정호  95
8  정몽주  90
9  김보람  99

In [ ]:
d.loc[0] #INDEXING

이름    이순신
국어     85
영어     87
수학     90
Name: 0, dtype: object

In [ ]:
d.loc[2]

이름    한석봉
국어     99
영어     98
수학     99
Name: 2, dtype: object

In [ ]:
d.loc[3]

이름    황진이
국어     35
영어     45
수학     20
Name: 3, dtype: object

In [ ]:
d.loc[3:6] #n-1이 아님

    이름  국어  영어  수학
3  황진이  35  45  20
4  안중근  90  85  90
5  박문수  95  98  96
6  임꺽정  15  35  45

In [ ]:
d[:]

    이름  국어  영어  수학
0  이순신  85  87  90
1  강감찬  75  80  95
2  한석봉  99  98  99
3  황진이  35  45  20
4  안중근  90  85  90
5  박문수  95  98  96
6  임꺽정  15  35  45
7  김정호  90  95  80
8  정몽주  90  90  95
9  김보람  95  99  98

In [ ]:
d[ : :2] #start : end : step

In [ ]:
d.loc[[2:3],['영어','수학']]

SyntaxError: ignored

In [ ]:
d['국어']

0    85
1    75
2    99
3    35
4    90
5    95
6    15
7    90
8    90
9    95
Name: 국어, dtype: int64

In [ ]:
d[[['이름', '영어']]

SyntaxError: ignored

In [ ]:
d[3] #ERROR

In [ ]:
d.loc[3]

이름    황진이
국어     35
영어     45
수학     20
Name: 3, dtype: object

In [ ]:
d.loc[5:9]

    이름  국어  영어  수학
5  박문수  95  98  96
6  임꺽정  15  35  45
7  김정호  90  95  80
8  정몽주  90  90  95
9  김보람  95  99  98

In [ ]:
d.loc[::-2]

    이름  국어  영어  수학
9  김보람  95  99  98
7  김정호  90  95  80
5  박문수  95  98  96
3  황진이  35  45  20
1  강감찬  75  80  95

In [ ]:
d.loc[2:8:3]

    이름  국어  영어  수학
2  한석봉  99  98  99
5  박문수  95  98  96
8  정몽주  90  90  95

In [ ]:
d.loc[ : , : ]

    이름  국어  영어  수학
0  이순신  85  87  90
1  강감찬  75  80  95
2  한석봉  99  98  99
3  황진이  35  45  20
4  안중근  90  85  90
5  박문수  95  98  96
6  임꺽정  15  35  45
7  김정호  90  95  80
8  정몽주  90  90  95
9  김보람  95  99  98

In [ ]:
d.loc[ : , ['수학', '영어']]

In [ ]:
d.loc[ : , ['영어', '수학']] #slicing

   영어  수학
0  87  90
1  80  95
2  98  99
3  45  20
4  85  90
5  98  96
6  35  45
7  95  80
8  90  95
9  99  98

In [ ]:
d.loc[5:6 ,['영어','수학'] ]

   영어  수학
5  98  96
6  35  45

In [ ]:
d.loc[3:2]

Empty DataFrame
Columns: [이름, 국어, 영어, 수학]
Index: []

In [ ]:
d[3][2] #error

In [ ]:
d.loc[3][2]

45

In [ ]:
d.loc[0][0]

'이순신'

In [ ]:
d.loc[3:4 ,['영어','수학'] ]

   영어  수학
3  45  20
4  85  90

In [ ]:
d.loc[1][1]

75

In [ ]:
d.index

RangeIndex(start=0, stop=10, step=1)

In [ ]:
d.shape

(10, 4)

In [ ]:
d.ndim #dimension

2

In [ ]:
type(d) # DataFrame 2차원 차원 테이터

pandas.core.frame.DataFrame

In [ ]:
type(d['국어']) # Series 1차원 배열

pandas.core.series.Series